/*
Сортировка пузырьком: время выполнения О(n^2), память O(n) 
кол-во операций для массива из 1000 элментов = 1000^2 = 1 000 000  n это кол-во элементов в массиве!!!!
Быстрая сортировка: время выполнения О (n * log n) основание log = 2, память O(n)
кол-во операций для массива из 1000 элментов = 1000 * log 1000 = 9900
Сортировка выбором: время выполнения O(n^2/2), память O(n + 1)
кол-во операций для массива из 1000 элментов = 500 000
Сортировка подсчётом: время выполнения О( n + k) k -кол-во уникальных элементов, память О( n + k)
кол-во операций для массива из 1000 элментов около 2000
*/
